# CanHaveEqualityFormula Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionType..::..CanHaveEqualityFormula Method
DimensionType Class See Also
---
Checks whether this DimensionType can have an equality formula.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool CanHaveEqualityFormula()
```

Visual Basic
---
```text
Public Function CanHaveEqualityFormula As Boolean
```

Visual C++
---
```text
public:
bool CanHaveEqualityFormula()
```

# ### Return Value
True when the DimensionType is continuous linear or angular, false otherwise
# Remarks
Equality formulas can be used for continuous linear or angular dimension types.
# See Also
DimensionType Class
Autodesk.Revit.DB Namespace